niwciu/MODBUS/examples/STM32G070RB_MODBUS_MASTER/Core/Inc/modbus_driver_config.h
/**
 * @file modbus_driver_config.h
 * @author niwciu (niwciu@gmail.com)
 * @brief Header file with defines that speed up modbus driver configuration
 *        specially when porting driver to different USARTs and Timers.
 * @version 1.0.0
 * @date 2025-08-31
 *
 * @copyright Copyright (c) 2025
 *
 */
#pragma once

#include "stm32g070xx.h"

#define OFF 0
#define ON 1
#define LOW 0
#define HIGH 1

#define MASTER_USE_DMA ON
#define MASTER_USART_DE_HW_CONTROLL ON

/** modbus USART configuration — USART1, GPIOB: PB6=TX(AF0), PB7=RX(AF0), PB3=DE(AF4) */
#define MODBUS_MASTER_USART (USART1)
#define MODBUS_MASTER_USART_CLK APBENR2
#define MODBUS_MASTER_USART_CLK_EN (RCC_APBENR2_USART1EN)
#define MODBUS_MASTER_USART_CLK_FREQ 64000000UL
#define MODBUS_MASTER_USART_IRQN USART1_IRQn
#define MODBUS_MASTER_USART_IRQHandler USART1_IRQHandler
#define MODBUS_MASTER_USART_IRQ_PRIORITY 10

#if MASTER_USE_DMA == ON
#define MODBUS_MASTER_DMA DMA1
#define MODBUS_MASTER_DMA_IRQN DMA1_Channel2_3_IRQn
#define MODBUS_MASTER_DMA_IRQHandler DMA1_Channel2_3_IRQHandler
#define MODBUS_MASTER_DMA_chanel DMA1_Channel2
#define MODBUS_MASTER_DMA_ISR_TCIF DMA_ISR_TCIF2
#define MODBUS_MASTER_DMA_ISR_TEIF DMA_ISR_TEIF2

#define USART2_TX_RESOURCE 53
#define USART1_TX_RESOURCE 51
#define MODBUS_MASTER_USART_TX_RESOURCE USART1_TX_RESOURCE

#define MODBUS_MASTER_DMAMUX_Chanel (DMAMUX1_Channel1)
#endif

#define MODBUS_MASTER_USART_RX_TX_PORT (GPIOB)
#define MODBUS_MASTER_USART_DE_PORT (GPIOB)

#define MODBUS_MASTER_USART_RX_MODE (GPIO_MODER_MODE7_1) // PB7, AF mode
#define MODBUS_MASTER_USART_TX_MODE (GPIO_MODER_MODE6_1) // PB6, AF mode
#if MASTER_USART_DE_HW_CONTROLL == ON
#define MODBUS_MASTER_USART_DE_MODE (GPIO_MODER_MODE3_1) // PB3, AF mode
#else
#define MODBUS_MASTER_USART_DE_MODE (GPIO_MODER_MODE3_0) // PB3, output mode
#endif

#define MODBUS_MASTER_USART_RX_MODE_Msk (GPIO_MODER_MODE7)
#define MODBUS_MASTER_USART_TX_MODE_Msk (GPIO_MODER_MODE6)
#define MODBUS_MASTER_USART_DE_MODE_Msk (GPIO_MODER_MODE3)

#define MODBUS_MASTER_USART_RX_AF_Msk (GPIO_AFRL_AFSEL7)
#define MODBUS_MASTER_USART_TX_AF_Msk (GPIO_AFRL_AFSEL6)
#if MASTER_USART_DE_HW_CONTROLL == ON
#define MODBUS_MASTER_USART_DE_AF_Msk (GPIO_AFRL_AFSEL3)
#endif

#define MODBUS_MASTER_USART_RX_AF (0)
#define MODBUS_MASTER_USART_TX_AF (0)
#if MASTER_USART_DE_HW_CONTROLL == ON
#define MODBUS_MASTER_USART_DE_AF (GPIO_AFRL_AFSEL3_2) // AF4
#endif

#define MODBUS_MASTER_USART_RX_TX_AF_REG (LOW)
#if MASTER_USART_DE_HW_CONTROLL == ON
#define MODBUS_MASTER_USART_DE_AF_REG (LOW)
#endif

// additional defines for manual DE control
#if MASTER_USART_DE_HW_CONTROLL == OFF
#define MODBUS_MASTER_USART_DE_PUPDR     GPIO_PUPDR_PUPD3_0
#define MODBUS_MASTER_USART_DE_PUPDR_Msk GPIO_PUPDR_PUPD3_Msk
#define MODBUS_MASTER_USART_DE_RESET_PIN GPIO_BSRR_BR3
#define MODBUS_MASTER_USART_DE_SET_PIN   GPIO_BSRR_BS3
#endif

#define MODBUS_MASTER_USART_GPIO_RX_TX_CLK_EN (RCC_IOPENR_GPIOBEN)
#define MODBUS_MASTER_USART_GPIO_DE_CLK_EN (RCC_IOPENR_GPIOBEN)

/** modbus Timer configuration — TIM7 */
#define MODBUS_MASTER_TIMER (TIM7)
#define MODBUS_MASTER_TIMER_APBENR (RCC->APBENR1)
#define MODBUS_MASTER_TIMER_CLK_EN (RCC_APBENR1_TIM7EN)
#define MODBUS_MASTER_TIMER_CLK_FREQ 64000000UL
#define MODBUS_MASTER_TIMER_IRQN TIM7_IRQn
#define MODBUS_MASTER_TIMER_IRQHandler TIM7_IRQHandler
#define MODBUS_MASTER_TIMER_IRQ_PRIORITY 10
